# homebrew-cli-toolbelt: full collection
# ~45+ tools. the complete modern CLI developer toolkit.
# "give me everything"
#
# install: brew bundle --file=Brewfile

# ============================================================
# MODERN CLI REPLACEMENTS
# drop-in upgrades for legacy Unix commands
# ============================================================
brew "bat"           # cat > syntax highlighting, line numbers, git markers
brew "eza"           # ls  > git status, icons, tree view
brew "fd"            # find > simpler syntax, respects .gitignore
brew "ripgrep"       # grep > 10-100x faster, smart case
brew "zoxide"        # cd  > frecency-based directory jumping
brew "git-delta"     # diff > syntax-highlighted, word-level changes
brew "dust"          # du  > visual bar graph disk usage
brew "duf"           # df  > colorful disk free table
brew "sd"            # sed > intuitive string replacement
brew "procs"         # ps  > colorful, searchable process list
brew "tailspin"      # tail > auto-highlights log files
brew "ncdu"          # du  > interactive disk usage explorer (TUI)
brew "gping"         # ping > real-time graphical ping charts

# ============================================================
# CORE DEVELOPER TOOLS
# the productivity backbone
# ============================================================
brew "fzf"           # fuzzy finder for everything (Ctrl+R, Ctrl+T)
brew "jq"            # JSON processing and pretty-printing
brew "lazygit"       # full git TUI (staging, rebasing, conflicts)
brew "starship"      # cross-shell prompt (git, languages, duration)
brew "atuin"         # shell history with search, sync, and context
brew "btop"          # gorgeous system/process monitor
brew "tldr"          # simplified man pages with examples
brew "gh"            # GitHub CLI (PRs, issues, Actions)
brew "just"          # modern make/task runner (Justfile)
brew "mise"          # polyglot version manager (replaces nvm/pyenv/asdf)

# ============================================================
# TUI APPLICATIONS
# terminal user interfaces that replace GUI apps
# ============================================================
brew "yazi"          # file manager with previews (replaces Finder)
brew "zellij"        # terminal multiplexer with discoverable UI
brew "gitui"         # lightweight git TUI (Rust, fast)
brew "superfile"     # beginner-friendly file manager (mouse-driven)
brew "bottom"        # alternative system monitor (graph-focused)
brew "htop"          # classic lightweight process viewer

# ============================================================
# SHELL ENHANCEMENTS
# make zsh smarter
# ============================================================
brew "zsh-autosuggestions"       # fish-like ghost text suggestions
brew "zsh-syntax-highlighting"   # real-time command validation
brew "thefuck"       # auto-corrects mistyped commands

# ============================================================
# TEXT EDITORS
# graduated from "edit a file" to "full IDE"
# ============================================================
brew "micro"         # stage 1: GUI-like keybindings (Ctrl+S/C/V)
brew "helix"         # stage 2: modal editor with built-in LSP
brew "neovim"        # stage 3: the extensibility ceiling

# ============================================================
# DEVELOPER PRODUCTIVITY
# tools you didn't know you needed
# ============================================================
brew "httpie"        # human-friendly HTTP client
brew "xh"            # fast HTTP client (Rust, HTTPie-compatible)
brew "hyperfine"     # CLI benchmarking (compare command speeds)
brew "tokei"         # count lines of code by language
brew "watchexec"     # run commands on file changes
brew "entr"          # simple file watcher (rerun on save)
brew "glow"          # render markdown beautifully in terminal
brew "gum"           # glamorous shell script components
brew "navi"          # interactive cheatsheets with fuzzy search
brew "fx"            # interactive JSON viewer (tree navigation)
brew "yq"            # YAML/TOML processor (jq for YAML)
brew "direnv"        # per-directory environment variables
brew "forgit"        # fzf-powered git commands

# ============================================================
# NETWORKING AND API TOOLS
# debug and explore from terminal
# ============================================================
brew "doggo"         # modern DNS client (replaces dig)
brew "bandwhich"     # bandwidth usage per process
brew "trippy"        # visual traceroute + ping + mtr
brew "aria2"         # fast multi-protocol download utility

# ============================================================
# PREVIEW DEPENDENCIES
# needed by yazi for rich file previews
# ============================================================
brew "ffmpeg"        # video thumbnail generation
brew "poppler"       # PDF rendering

# ============================================================
# FONTS (Nerd Font for icons in eza, yazi, starship)
# ============================================================
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# ============================================================
# TERMINAL EMULATORS
# the window your terminal runs in
# ============================================================
cask "ghostty"       # native macOS terminal (Metal, zero-config)
cask "iterm2"        # feature-rich macOS terminal (tmux integration)
